## Missing Data:

### lets go through some of the tricks we can used to handle missing data in Pandas

In [1]:
import numpy as np
import pandas as pd

In [15]:
dic = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}

In [18]:
df = pd.DataFrame(dic)

In [20]:
df  # we intentionally created some of the nan values in our DataFrame to handle them

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## dropna():

In [23]:
df.dropna() # drops all the nan or NULL values from DataFrame

     A    B  C
0  1.0  5.0  1

In [24]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [44]:
df.dropna(axis = 1) # drops the columns that have atleast 1 NULL value

   C
0  1
1  2
2  3

In [45]:
df.dropna(axis = 0) # drops the rows that have atleast 1 NULL value

     A    B  C
0  1.0  5.0  1

In [29]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
df.dropna(thresh = 2) # keeps the row that have atleast 2 non-NULL values and drops rest of all

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [37]:
# to understand fully how thresh argument works
# lets consider another example

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [48]:
df.dropna(thresh = 3) # reports back the only row which have 3 non-NULL values and drops rest of all

     A    B  C
0  1.0  5.0  1

## fillna():

In [49]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [52]:
df.fillna(value = 'FILLED VALUE') # reports back the values which we have assigned in our NULL places

              A             B  C
0             1             5  1
1             2  FILLED VALUE  2
2  FILLED VALUE  FILLED VALUE  3

In [59]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [66]:
df['A'].fillna(value = np.mean(df['A'])) # reports back the NULL values filled with mean values of the column

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [67]:
df['B'].fillna(value = df['B'].mean()) # reports back the NULL values filled with mean values of the column

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64